<a href="https://colab.research.google.com/github/temple17/python-for-data-analysis-2nd-edition/blob/main/Chapter8_(p_239~).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [21]:
import numpy as np
import pandas as pd

In [22]:
# Data Wrangling: Join, Combine, and Reshape

In [23]:
# 8.1 Hierarchical Indexing

data = pd.Series(np.random.randn(9),
                 index = [['a','a','a','b','b','c','c','d','d'],
                          [1,2,3,1,3,1,2,2,3]])

In [24]:
data

a  1    0.040998
   2    1.507449
   3   -1.047709
b  1   -0.246801
   3    0.790183
c  1    0.298300
   2    0.292908
d  2   -0.615135
   3    0.814849
dtype: float64

In [25]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 2),
            ('d', 3)],
           )

In [26]:
data['b']

1   -0.246801
3    0.790183
dtype: float64

In [27]:
data['b': 'c']

b  1   -0.246801
   3    0.790183
c  1    0.298300
   2    0.292908
dtype: float64

In [28]:
data.loc[:, 2]

a    1.507449
c    0.292908
d   -0.615135
dtype: float64

In [29]:
data.unstack()

          1         2         3
a  0.040998  1.507449 -1.047709
b -0.246801       NaN  0.790183
c  0.298300  0.292908       NaN
d       NaN -0.615135  0.814849

In [30]:
data.unstack().stack()

a  1    0.040998
   2    1.507449
   3   -1.047709
b  1   -0.246801
   3    0.790183
c  1    0.298300
   2    0.292908
d  2   -0.615135
   3    0.814849
dtype: float64

In [31]:
frame = pd.DataFrame(np.arange(12).reshape((4,3)),
                     index = [['a','a','b','b'], [1,2,1,2]],
                     columns = [['Ohio', 'Ohio','Colorado'],
                                ['Green', 'Red', 'Green']])

In [32]:
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [33]:
frame.index.names = ['key1', 'key2']

In [34]:
frame.columns.names = ['state', 'color']

In [35]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [36]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [37]:
# Reordering and Sorting Levels

frame.swaplevel('key1','key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [38]:
frame.sort_index(level=1)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [39]:
frame.sort_index(level=0)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [40]:
frame.swaplevel(0,1).sort_index(level=0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

In [41]:
frame.sum(level= 'key2')

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [42]:
frame.sum(level = 'color', axis = 1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

In [43]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [44]:
# Indexing with a DataFrame's columns

frame = pd.DataFrame({'a' : range(7), 'b' : range(7, 0 , -1),
                      'c': ['one','one','one','two','two','two','two'],
                      'd': [0,1,2,0,1,2,3]})

In [45]:
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [46]:
frame2 = frame.set_index(['c','d'])

In [47]:
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [48]:
frame.set_index(['c','d'], drop = False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [49]:
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

In [50]:
# 8.2 Combining and Merging Datasets

# Database-style DataFrame Joins

df1 = pd.DataFrame({'key': ['b','b','a','c','a','a','b'],
                    'data1': range(7)})

df2 = pd.DataFrame({'key': ['a','b','c'],
                    'data2': range(3)})

In [51]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [52]:
df2

  key  data2
0   a      0
1   b      1
2   c      2

In [53]:
pd.merge(df1, df2)

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0
6   c      3      2

In [54]:
pd.merge(df1, df2, on ='key')

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0
6   c      3      2

In [55]:
df3 = pd.DataFrame({'lkey': ['b','b','a','c','a','a','b'],
                    'data1': range(7)})

df4 = pd.DataFrame({'rkey' : ['a','b','d'],
                    'data2' : range(3)})

In [56]:
pd.merge(df3, df4, left_on = 'lkey', right_on = 'rkey')

  lkey  data1 rkey  data2
0    b      0    b      1
1    b      1    b      1
2    b      6    b      1
3    a      2    a      0
4    a      4    a      0
5    a      5    a      0

In [57]:
pd.merge(df1, df2, 'outer')

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0
6   c      3      2

In [58]:
df1 = pd.DataFrame({'key' : ['b','b','a','c','a','b'],
                    'data1': range(6)})

df2 = pd.DataFrame({'key' : ['a','b','a','b','d'],
                    'data2' : range(5)})

In [59]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [60]:
df2

  key  data2
0   a      0
1   b      1
2   a      2
3   b      3
4   d      4

In [61]:
pd.merge(df1, df2, on ='key', how = 'left')

   key  data1  data2
0    b      0    1.0
1    b      0    3.0
2    b      1    1.0
3    b      1    3.0
4    a      2    0.0
5    a      2    2.0
6    c      3    NaN
7    a      4    0.0
8    a      4    2.0
9    b      5    1.0
10   b      5    3.0

In [62]:
pd.merge(df1, df2, 'inner')

  key  data1  data2
0   b      0      1
1   b      0      3
2   b      1      1
3   b      1      3
4   b      5      1
5   b      5      3
6   a      2      0
7   a      2      2
8   a      4      0
9   a      4      2

In [63]:
left = pd.DataFrame({'key1': ['foo', 'foo', 'bar'],
                     'key2' : ['one','two','one'],
                     'lval' : [1,2,3]})

In [64]:
right = pd.DataFrame({'key1': ['foo','foo', 'bar','bar'],
                      'key2' : ['one', 'one','one', 'two'],
                      'rval' : [4,5,6,7]})

In [65]:
pd.merge(left, right, on = ['key1', 'key2'], how = 'outer')

  key1 key2  lval  rval
0  foo  one   1.0   4.0
1  foo  one   1.0   5.0
2  foo  two   2.0   NaN
3  bar  one   3.0   6.0
4  bar  two   NaN   7.0

In [66]:
pd.merge(left, right, on = 'key1')

  key1 key2_x  lval key2_y  rval
0  foo    one     1    one     4
1  foo    one     1    one     5
2  foo    two     2    one     4
3  foo    two     2    one     5
4  bar    one     3    one     6
5  bar    one     3    two     7

In [67]:
pd.merge(left, right, on = 'key1', suffixes= ('_left', '_right'))

  key1 key2_left  lval key2_right  rval
0  foo       one     1        one     4
1  foo       one     1        one     5
2  foo       two     2        one     4
3  foo       two     2        one     5
4  bar       one     3        one     6
5  bar       one     3        two     7

In [70]:
# Merging on Index  
left1 = pd.DataFrame({'key' : ['a','b','a','a','b','c'],
                       'value' : range(6)})

right1 = pd.DataFrame({'group_val' : [3.5, 7]}, index = ['a','b'])

In [71]:
left1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [72]:
right1

   group_val
a        3.5
b        7.0

In [73]:
pd.merge(left1, right1, left_on = 'key', right_index = True)

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0

In [74]:
pd.merge(left1, right1, left_on = 'key', right_index = True, how = 'outer')

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0
5   c      5        NaN

In [76]:
lefth = pd.DataFrame({'key1' : ['Ohio', 'Ohio', 'Ohio','Nevada','Nevada'],
                     'key2' : [2000, 2001, 2002, 2001, 2002],
                     'data' : np.arange(5.)})

In [77]:
righth = pd.DataFrame(np.arange(12).reshape((6,2)),
                      index = [['Nevada', 'Nevada', 'Ohio','Ohio', 'Ohio','Ohio'],
                               [2001,2000,2000,2000,2001,2002]],
                      columns = ['event1','event2'])

In [78]:
lefth

     key1  key2  data
0    Ohio  2000   0.0
1    Ohio  2001   1.0
2    Ohio  2002   2.0
3  Nevada  2001   3.0
4  Nevada  2002   4.0

In [79]:
righth

             event1  event2
Nevada 2001       0       1
       2000       2       3
Ohio   2000       4       5
       2000       6       7
       2001       8       9
       2002      10      11

In [80]:
pd.merge(lefth, righth, left_on = ['key1', 'key2'], right_index = True)

     key1  key2  data  event1  event2
0    Ohio  2000   0.0       4       5
0    Ohio  2000   0.0       6       7
1    Ohio  2001   1.0       8       9
2    Ohio  2002   2.0      10      11
3  Nevada  2001   3.0       0       1

In [81]:
pd.merge(lefth, righth, left_on = ['key1','key2'], right_index = True, how = 'outer')

     key1  key2  data  event1  event2
0    Ohio  2000   0.0     4.0     5.0
0    Ohio  2000   0.0     6.0     7.0
1    Ohio  2001   1.0     8.0     9.0
2    Ohio  2002   2.0    10.0    11.0
3  Nevada  2001   3.0     0.0     1.0
4  Nevada  2002   4.0     NaN     NaN
4  Nevada  2000   NaN     2.0     3.0

In [86]:
left2 = pd.DataFrame([[1.,2.], [3.,4.], [5., 6.]],
                    index = ['a','c','e'],
                    columns = ['Ohio', 'Nevada'])

In [87]:
right2 = pd.DataFrame([[7., 8.], [9., 10.], [11., 12.], [13,14]],
                       index = ['b','c','d','e'],
                       columns = ['Missouri', 'Alabama'])

In [88]:
left2

   Ohio  Nevada
a   1.0     2.0
c   3.0     4.0
e   5.0     6.0

In [89]:
right2

   Missouri  Alabama
b       7.0      8.0
c       9.0     10.0
d      11.0     12.0
e      13.0     14.0

In [90]:
pd.merge(left2, right2, how = 'outer', left_index = True, right_index = True)

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
b   NaN     NaN       7.0      8.0
c   3.0     4.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   5.0     6.0      13.0     14.0

In [92]:
left2.join(right2, how = 'outer')

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
b   NaN     NaN       7.0      8.0
c   3.0     4.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   5.0     6.0      13.0     14.0

In [93]:
left1.join(right1, on = 'key')

  key  value  group_val
0   a      0        3.5
1   b      1        7.0
2   a      2        3.5
3   a      3        3.5
4   b      4        7.0
5   c      5        NaN

In [94]:
another = pd.DataFrame([[7., 8.], [9., 10.], [11., 12.], [16.,17.]],
                       index = ['a','c','e','f'],
                       columns = ['New York', 'Oregon'])

In [95]:
another

   New York  Oregon
a       7.0     8.0
c       9.0    10.0
e      11.0    12.0
f      16.0    17.0

In [96]:
left2.join([right2, another])

   Ohio  Nevada  Missouri  Alabama  New York  Oregon
a   1.0     2.0       NaN      NaN       7.0     8.0
c   3.0     4.0       9.0     10.0       9.0    10.0
e   5.0     6.0      13.0     14.0      11.0    12.0

In [97]:
left2.join([right2, another], how = 'outer')

   Ohio  Nevada  Missouri  Alabama  New York  Oregon
a   1.0     2.0       NaN      NaN       7.0     8.0
c   3.0     4.0       9.0     10.0       9.0    10.0
e   5.0     6.0      13.0     14.0      11.0    12.0
b   NaN     NaN       7.0      8.0       NaN     NaN
d   NaN     NaN      11.0     12.0       NaN     NaN
f   NaN     NaN       NaN      NaN      16.0    17.0

In [98]:
# Concatenating Along as Axis

arr = np.arange(12).reshape((3,4))

In [104]:
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [105]:
np.concatenate([arr, arr], axis = 1)

array([[ 0,  1,  2,  3,  0,  1,  2,  3],
       [ 4,  5,  6,  7,  4,  5,  6,  7],
       [ 8,  9, 10, 11,  8,  9, 10, 11]])

In [106]:
s1 = pd.Series([0,1], index = ['a','b'])

In [107]:
s2 = pd.Series([2,3,4], index = ['c','d','e'])

In [109]:
s3 = pd.Series([5,6], index = ['f','g'])

In [110]:
pd.concat([s1, s2, s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [111]:
pd.concat([s1, s2, s3], axis = 1)

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

In [112]:
s4 = pd.concat([s1, s3])

In [113]:
s4

a    0
b    1
f    5
g    6
dtype: int64

In [114]:
 pd.concat([s1, s4], axis = 1)

     0  1
a  0.0  0
b  1.0  1
f  NaN  5
g  NaN  6

In [115]:
pd.concat([s1, s4], axis = 1, join = 'inner')

   0  1
a  0  0
b  1  1

In [117]:
result = pd.concat([s1, s2, s3], keys = ['one', 'two', 'three'])

In [118]:
result

one    a    0
       b    1
two    c    2
       d    3
       e    4
three  f    5
       g    6
dtype: int64

In [119]:
result.unstack()

         a    b    c    d    e    f    g
one    0.0  1.0  NaN  NaN  NaN  NaN  NaN
two    NaN  NaN  2.0  3.0  4.0  NaN  NaN
three  NaN  NaN  NaN  NaN  NaN  5.0  6.0

In [120]:
pd.concat([s1, s2, s3], axis = 1, keys = ['one','two','three'])

   one  two  three
a  0.0  NaN    NaN
b  1.0  NaN    NaN
c  NaN  2.0    NaN
d  NaN  3.0    NaN
e  NaN  4.0    NaN
f  NaN  NaN    5.0
g  NaN  NaN    6.0

In [121]:
df1 = pd.DataFrame(np.arange(6).reshape(3,2), index = ['a','b','c'],
                   columns = ['one','two'])

In [122]:
df2 = pd.DataFrame(5 + np.arange(4).reshape(2, 2), index = ['a','c'],
                   columns = ['three', 'four'])

In [123]:
df1

   one  two
a    0    1
b    2    3
c    4    5

In [124]:
df2

   three  four
a      5     6
c      7     8

In [125]:
pd.concat([df1, df2], axis = 1, keys = ['level1', 'level2'])

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

In [126]:
pd.concat({'level1' : df1, 'level2': df2}, axis = 1)

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

In [127]:
pd.concat([df1, df2], axis = 1, keys = ['level1', 'level2'],
          names = ['upper', 'lower'])

upper level1     level2
lower    one two  three four
a          0   1    5.0  6.0
b          2   3    NaN  NaN
c          4   5    7.0  8.0

In [128]:
df1 = pd.DataFrame(np.random.randn(3, 4), columns = ['a','b','c','d'])

In [129]:
df2 = pd.DataFrame(np.random.randn(2, 3), columns = ['b','d','a'])

In [130]:
df1

          a         b         c         d
0  0.360290  0.943492 -1.801262 -0.481022
1  0.191699  1.092361 -0.343699 -0.529304
2  0.360331  0.968556 -0.333370  0.623060

In [131]:
df2

          b         d         a
0 -0.120401 -1.012457  0.245275
1  1.309514  0.760650  2.225777

In [132]:
pd.concat([df1, df2], ignore_index = True)

          a         b         c         d
0  0.360290  0.943492 -1.801262 -0.481022
1  0.191699  1.092361 -0.343699 -0.529304
2  0.360331  0.968556 -0.333370  0.623060
3  0.245275 -0.120401       NaN -1.012457
4  2.225777  1.309514       NaN  0.760650

In [133]:
# Combining Data with Overlap

a = pd.Series([np.nan, 2.5, np.nan, 3.5, 4.5, np.nan], 
              index = ['f','e','d','c','b','a'])

In [135]:
b = pd.Series(np.arange(len(a), dtype = np.float64), 
                        index = ['f','e','d','c','b','a'])

In [136]:
a

f    NaN
e    2.5
d    NaN
c    3.5
b    4.5
a    NaN
dtype: float64

In [137]:
b

f    0.0
e    1.0
d    2.0
c    3.0
b    4.0
a    5.0
dtype: float64

In [138]:
b[-1] = np.nan

In [139]:
b

f    0.0
e    1.0
d    2.0
c    3.0
b    4.0
a    NaN
dtype: float64

In [140]:
np.where(pd.isnull(a), b,a)

array([0. , 2.5, 2. , 3.5, 4.5, nan])

In [141]:
b[:-2].combine_first(a[2:])

a    NaN
b    4.5
c    3.0
d    2.0
e    1.0
f    0.0
dtype: float64

In [146]:
df1 = pd.DataFrame({'a': [1., np.nan, 5., np.nan],
                    'b' : [np.nan, 2., np.nan, 6.],
                    'c' : range(2,18,4)})

In [147]:
df2 = pd.DataFrame({'a' :[5., 4., np.nan, 3., 7.],
                    'b' : [np.nan, 3., 4., 6., 8.]})

In [148]:
df1

     a    b   c
0  1.0  NaN   2
1  NaN  2.0   6
2  5.0  NaN  10
3  NaN  6.0  14

In [149]:
df2

     a    b
0  5.0  NaN
1  4.0  3.0
2  NaN  4.0
3  3.0  6.0
4  7.0  8.0

In [150]:
df1.combine_first(df2)

     a    b     c
0  1.0  NaN   2.0
1  4.0  2.0   6.0
2  5.0  4.0  10.0
3  3.0  6.0  14.0
4  7.0  8.0   NaN

In [160]:
# 8.3 Reshaping and Pivoting

# Reshaping with Hierarchical Indexing

data = pd.DataFrame(np.arange(6).reshape((2,3)),
                    index = pd.Index(['Ohio', 'Colorado'], name = 'state'),
                    columns = pd.Index(['one', 'two', 'three'],
                                       name = 'number'))

In [161]:
data

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [166]:
result = data.stack()

In [163]:
result

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int64

In [167]:
result.unstack()

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [171]:
result.unstack(0)

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

In [169]:
result.unstack('state')

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

In [172]:
s1 = pd.Series([0,1,2,3], index = ['a','b','c','d'])

In [173]:
s2 = pd.Series([4,5,6], index = ['c','d','e'])

In [174]:
data2 = pd.concat([s1, s2], keys = ['one','two'])

In [175]:
data2

one  a    0
     b    1
     c    2
     d    3
two  c    4
     d    5
     e    6
dtype: int64

In [176]:
data2.unstack()

       a    b    c    d    e
one  0.0  1.0  2.0  3.0  NaN
two  NaN  NaN  4.0  5.0  6.0

In [178]:
data2.unstack().stack()

one  a    0.0
     b    1.0
     c    2.0
     d    3.0
two  c    4.0
     d    5.0
     e    6.0
dtype: float64

In [179]:
data2.unstack().stack(dropna = False)

one  a    0.0
     b    1.0
     c    2.0
     d    3.0
     e    NaN
two  a    NaN
     b    NaN
     c    4.0
     d    5.0
     e    6.0
dtype: float64

In [180]:
df = pd.DataFrame({'left' : result, 'right' : result + 5},
                  columns = pd.Index(['left', 'right'], name = 'side'))

In [181]:
df

side             left  right
state    number
Ohio     one        0      5
         two        1      6
         three      2      7
Colorado one        3      8
         two        4      9
         three      5     10

In [182]:
df.unstack('state')

side   left          right
state  Ohio Colorado  Ohio Colorado
number
one       0        3     5        8
two       1        4     6        9
three     2        5     7       10

In [186]:
df.unstack('state').stack('side')

state         Colorado  Ohio
number side
one    left          3     0
       right         8     5
two    left          4     1
       right         9     6
three  left          5     2
       right        10     7

In [187]:
# Pivoting "Long" to "Wide" Format

data = pd.read_csv('/content/drive/MyDrive/python_for_data_analysis_2nd_edition/examples/macrodata.csv')

In [188]:
data.head()

     year  quarter   realgdp  realcons  ...  unemp      pop  infl  realint
0  1959.0      1.0  2710.349    1707.4  ...    5.8  177.146  0.00     0.00
1  1959.0      2.0  2778.801    1733.7  ...    5.1  177.830  2.34     0.74
2  1959.0      3.0  2775.488    1751.8  ...    5.3  178.657  2.74     1.09
3  1959.0      4.0  2785.204    1753.7  ...    5.6  179.386  0.27     4.06
4  1960.0      1.0  2847.699    1770.5  ...    5.2  180.007  2.31     1.19

[5 rows x 14 columns]

In [189]:
periods = pd.PeriodIndex(year = data.year, quarter = data.quarter,
                         name = 'date')

In [191]:
columns = pd.Index(['realgdp', 'infl', 'unemp'], name = 'item')

In [192]:
data = data.reindex(columns = columns)

In [193]:
data.index = periods.to_timestamp('D', 'end')

In [195]:
ldata = data.stack().reset_index().rename(columns = {0: 'value'})

In [196]:
ldata[:10]

                           date     item     value
0 1959-03-31 23:59:59.999999999  realgdp  2710.349
1 1959-03-31 23:59:59.999999999     infl     0.000
2 1959-03-31 23:59:59.999999999    unemp     5.800
3 1959-06-30 23:59:59.999999999  realgdp  2778.801
4 1959-06-30 23:59:59.999999999     infl     2.340
5 1959-06-30 23:59:59.999999999    unemp     5.100
6 1959-09-30 23:59:59.999999999  realgdp  2775.488
7 1959-09-30 23:59:59.999999999     infl     2.740
8 1959-09-30 23:59:59.999999999    unemp     5.300
9 1959-12-31 23:59:59.999999999  realgdp  2785.204

In [198]:
pivoted = ldata.pivot('date', 'item', 'value')

In [199]:
pivoted

item                           infl    realgdp  unemp
date
1959-03-31 23:59:59.999999999  0.00   2710.349    5.8
1959-06-30 23:59:59.999999999  2.34   2778.801    5.1
1959-09-30 23:59:59.999999999  2.74   2775.488    5.3
1959-12-31 23:59:59.999999999  0.27   2785.204    5.6
1960-03-31 23:59:59.999999999  2.31   2847.699    5.2
...                             ...        ...    ...
2008-09-30 23:59:59.999999999 -3.16  13324.600    6.0
2008-12-31 23:59:59.999999999 -8.79  13141.920    6.9
2009-03-31 23:59:59.999999999  0.94  12925.410    8.1
2009-06-30 23:59:59.999999999  3.37  12901.504    9.2
2009-09-30 23:59:59.999999999  3.56  12990.341    9.6

[203 rows x 3 columns]

In [201]:
ldata['value2'] = np.random.randn(len(ldata))

In [202]:
ldata[:10]

                           date     item     value    value2
0 1959-03-31 23:59:59.999999999  realgdp  2710.349 -0.906469
1 1959-03-31 23:59:59.999999999     infl     0.000  0.992667
2 1959-03-31 23:59:59.999999999    unemp     5.800  1.567428
3 1959-06-30 23:59:59.999999999  realgdp  2778.801  0.851037
4 1959-06-30 23:59:59.999999999     infl     2.340 -0.934789
5 1959-06-30 23:59:59.999999999    unemp     5.100  0.893551
6 1959-09-30 23:59:59.999999999  realgdp  2775.488 -0.120049
7 1959-09-30 23:59:59.999999999     infl     2.740  0.005037
8 1959-09-30 23:59:59.999999999    unemp     5.300  1.672179
9 1959-12-31 23:59:59.999999999  realgdp  2785.204  0.979931

In [203]:
pivoted = ldata.pivot('date', 'item')

In [204]:
pivoted[:5]

                              value            ...    value2
item                           infl   realgdp  ...   realgdp     unemp
date                                           ...
1959-03-31 23:59:59.999999999  0.00  2710.349  ... -0.906469  1.567428
1959-06-30 23:59:59.999999999  2.34  2778.801  ...  0.851037  0.893551
1959-09-30 23:59:59.999999999  2.74  2775.488  ... -0.120049  1.672179
1959-12-31 23:59:59.999999999  0.27  2785.204  ...  0.979931  0.547991
1960-03-31 23:59:59.999999999  2.31  2847.699  ... -0.665109 -0.026196

[5 rows x 6 columns]

In [205]:
pivoted['value'][:5]

item                           infl   realgdp  unemp
date
1959-03-31 23:59:59.999999999  0.00  2710.349    5.8
1959-06-30 23:59:59.999999999  2.34  2778.801    5.1
1959-09-30 23:59:59.999999999  2.74  2775.488    5.3
1959-12-31 23:59:59.999999999  0.27  2785.204    5.6
1960-03-31 23:59:59.999999999  2.31  2847.699    5.2

In [206]:
unstacked = ldata.set_index(['date', 'item']).unstack('item')

In [207]:
unstacked[:7]

                              value            ...    value2
item                           infl   realgdp  ...   realgdp     unemp
date                                           ...
1959-03-31 23:59:59.999999999  0.00  2710.349  ... -0.906469  1.567428
1959-06-30 23:59:59.999999999  2.34  2778.801  ...  0.851037  0.893551
1959-09-30 23:59:59.999999999  2.74  2775.488  ... -0.120049  1.672179
1959-12-31 23:59:59.999999999  0.27  2785.204  ...  0.979931  0.547991
1960-03-31 23:59:59.999999999  2.31  2847.699  ... -0.665109 -0.026196
1960-06-30 23:59:59.999999999  0.14  2834.390  ... -1.907539  1.136238
1960-09-30 23:59:59.999999999  2.70  2839.022  ...  1.079762 -0.903450

[7 rows x 6 columns]

In [209]:
# Pivoting "Wide" to "Long" Format

df = pd.DataFrame({'key': ['foo', 'bar','baz'],
                   'A' : [1,2,3],
                   'B' : [4,5,6],
                   'C' : [7,8,9]})

In [210]:
df

   key  A  B  C
0  foo  1  4  7
1  bar  2  5  8
2  baz  3  6  9

In [211]:
melted = pd.melt(df, ['key'])

In [212]:
melted

   key variable  value
0  foo        A      1
1  bar        A      2
2  baz        A      3
3  foo        B      4
4  bar        B      5
5  baz        B      6
6  foo        C      7
7  bar        C      8
8  baz        C      9

In [213]:
reshaped = melted.pivot('key', 'variable', 'value')

In [214]:
reshaped

variable  A  B  C
key
bar       2  5  8
baz       3  6  9
foo       1  4  7

In [215]:
reshaped.reset_index()

variable  key  A  B  C
0         bar  2  5  8
1         baz  3  6  9
2         foo  1  4  7

In [217]:
pd.melt(df, id_vars = ['key'], value_vars = ['A','B'])

   key variable  value
0  foo        A      1
1  bar        A      2
2  baz        A      3
3  foo        B      4
4  bar        B      5
5  baz        B      6

In [218]:
pd.melt(df, value_vars = ['A','B','C'])

  variable  value
0        A      1
1        A      2
2        A      3
3        B      4
4        B      5
5        B      6
6        C      7
7        C      8
8        C      9

In [219]:
pd.melt(df, value_vars = ['key', 'A','B'])

  variable value
0      key   foo
1      key   bar
2      key   baz
3        A     1
4        A     2
5        A     3
6        B     4
7        B     5
8        B     6